st = "1234567890-=qwerty0uiop[]"

# получаем символ 
# print(st[3])

# получаем символ с другой стороны
# print(st[-3])

# получаем 5 символов начиная с индекса 10
# print(st[5:10])

# получаем 5 символов через один начиная с индекса 10
# print(st[5:20:2])

# получаем каждый второй символ
# print(st[::2])

# получаем всю строку без двух символов в конце
# print(st[0:len(st)-2])

# получаем каждый 4 символ начиная со 2 индекса
print(st[2::4])




# .find(s) - возвращает индекс первого вхождения строки s
# print(st.find("8"))

# .count(s) - возвращает количество вхождений строки s
# print(st.count("0"))


# .split(s) - разделяет по строке s
str_1 = "132223-53625-7hhfgf-ff"
# print(str_1.split("-"))


# .join(x) - соединяет все строки списка x
arr = ["123" , "456" , "789"]
# print("*".join(arr))







